CSI API ETABS v1
cHelper.GetObjectHost Method
 Attaches to the active running instance of the program on a given computer using the default TCP port.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cOAPI GetObjectHost(
	string hostName,
	string progID
)
Function GetObjectHost (
	hostName As String,
	progID As String
) As cOAPI
Dim instance As cHelper
Dim hostName As String
Dim progID As String
Dim returnValue As cOAPI
returnValue = instance.GetObjectHost(hostName,
	progID)
cOAPI^ GetObjectHost(
	String^ hostName,
	String^ progID
)
abstract GetObjectHost :
        hostName : string *
        progID : string -> cOAPI
Parameters
hostName
Type: System.String
The host computer name.
progID
Type: System.String
The program ID of the API object.
Return Value
Type: cOAPI
An instance of cOAPI if successful, nothing otherwise.
Remarks
CSiAPIService.exe for must be running on the host computer and listening to the default TCP port for the call to succeed.
The default TCP port can be overridden by setting the environment variable ETABSv1_cOAPI_DEFAULT_PORT on both the Main and the Host computers.
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.GetObjectHost("RemoteServer", "CSI.ETABS.API.ETABSObject")
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace